OPENFOAM/drivenCavity/square_RE_10000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0.0 1.0 0.1)       // 0
    (0.0 0.5 0.1)       // 1
    (0.0 0.0 0.1)       // 2 
    (0.5 1.0 0.1)       // 3
    (0.5 0.5 0.1)       // 4
    (0.5 0.0 0.1)       // 5 
    (1.0 1.0 0.1)       // 6
    (1.0 0.5 0.1)       // 7
    (1.0 0.0 0.1)       // 8
//    
    (0.0 1.0 0.0)     // 9
    (0.0 0.5 0.0)     //10
    (0.0 0.0 0.0)     //11
    (0.5 1.0 0.0)     //12
    (0.5 0.5 0.0)     //13
    (0.5 0.0 0.0)     //14
    (1.0 1.0 0.0)     //15
    (1.0 0.5 0.0)     //16
    (1.0 0.0 0.0)     //17 
    
);

blocks
(
    hex ( 9 10 13 12  0  1  4  3) (50 50 1) simpleGrading ( 5  5 1)
    hex (10 11 14 13  1  2  5  4) (50 50 1) simpleGrading (.2  5 1)   
    hex (12 13 16 15  3  4  7  6) (50 50 1) simpleGrading ( 5 .2 1)
    hex (13 14 17 16  4  5  8  7) (50 50 1) simpleGrading (.2 .2 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (0 3 12  9)
            (3 6 15 12)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            ( 0  9 10  1)
            ( 1 10 11  2)
            //            
            ( 2 11 14  5)
            ( 5 14 17  8)
            //
            ( 8 17 16  7)
            ( 7 16 15  6)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (5 8 7 4)
            (4 7 6 3)
            //
            ( 9 12 13 10)
            (10 13 14 11)
            (12 15 16 13)
            (13 16 17 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
